Управление_торговлей.ПБТ/src/Documents/АктОтбора/АктОтбора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктОтбора</name>
  <registerRecords>AccumulationRegister.ОтборОбразцов</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбразцов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПервыйПровел</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ППК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ВИСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Образцы</name>
    <attributes>
      <name>ДатаИзготовления</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПродукта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>14</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗамеса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПометкаОбОтбореАрбитражногоОбразца</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СтранаПроисхождения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоступленияНаСклад</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРеализации</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.МаршрутныйЛист</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_ВидыИсследований</name>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>Лаборатория</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаОбразца</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧОбразцы</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Образец</name>
      <type>
        <types>CatalogRef.ЛабораторныйОбразец</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.ПериодичностьЛаб</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбрать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидИсследования</name>
      <type>
        <types>CatalogRef.ВидыИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧИсследований</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИныеПоказатели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/AccumulationRegisters/ОтборОбразцов/ОтборОбразцов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОтборОбразцов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.лаб_ВидыДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Образец</name>
    <type>
      <types>CatalogRef.ЛабораторныйОбразец</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/Enums/лаб_ВидыДокументов/лаб_ВидыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>лаб_ВидыДокументов</name>
  <enumValues>
    <name>АктПриемаОбразцов</name>
  </enumValues>
  <enumValues>
    <name>ПротоколАнализа</name>
  </enumValues>
  <enumValues>
    <name>УдостоверениеКачества</name>
  </enumValues>
  <enumValues>
    <name>ЧекЛист</name>
  </enumValues>
  <enumValues>
    <name>АктОтбора</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Catalogs/ЛабораторныйОбразец/ЛабораторныйОбразец.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛабораторныйОбразец</name>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.АктОтбора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаОбразца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерияНоменклатуры</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Управление_торговлей.ПБТ/src/Documents/АктОтбора/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Ошибка = "";
	
	Для Каждого СтрВИ Из ЭтотОбъект.ТЧ_ВидыИсследований Цикл
		// регистр ОтборОбразцов Приход
		Движение = Движения.ОтборОбразцов.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Номенклатура = ЭтотОбъект.Номенклатура;
		Движение.Период = Дата;
		Движение.ВидДокумента = Перечисления.лаб_ВидыДокументов.АктОтбора;
		Движение.ВидИсследования = СтрВИ.ВидИсследования;
		Движение.Лаборатория = СтрВИ.Лаборатория;
		Движение.Образец = СтрВИ.Образец;
		Движение.Количество = СтрВИ.Количество;
		
		//заполняем ссылку на этот документ в сам образец - потому что образцы создавались еще перед записью, чтобы их самих записать в тч
		Образец = СтрВИ.Образец;
		Если ЗначениеЗаполнено(Образец) Тогда
			Если НЕ Образец.ДокументПоступления = Ссылка Тогда
				ОбразецОб = Образец.ПолучитьОбъект();
				ОбразецОб.ДокументПоступления = Ссылка;
				
				ОбразецОб.Записать();
			КонецЕсли; 
		КонецЕсли; 
		
		//
		// регистр СтатусыОбразцов 
		//Движение = Движения.ОтборОбразцов.Добавить();
		//Движение.Период = ЭтотОбъект.Дата;
		//Движение.ДокументПоступления = ЭтотОбъект.Ссылка;
		//Движение.КодПродукта = ТекСтрокаТЧ_Образцы.КодПродукта;
		//Движение.Номенклатура = ЭтотОбъект.Номенклатура;
		//Движение.Организация = ЭтотОбъект.Организация;
		//Движение.Статус = Перечисления.лаб_СтатусыОбразца.ОтправленВЛабораторию;		//brava
	КонецЦикла;
	// записываем движения регистров
	Движения.ОтборОбразцов.Записать();
	//Движения.ОтборОбразцов.Записать();
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СтрВИ = "";  //для краткого представления видов исследований
	Для каждого СтрТЧВИ Из ТЧ_ВидыИсследований Цикл
		СтрВИ = СтрВИ + Лев(СтрТЧВИ.ВидИсследования,1);
		
		Если СтрТЧВИ.Количество = 0 Тогда
			СтрТЧВИ.Количество = 1;
		КонецЕсли;
		Если СтрТЧВИ.МассаОбразца = 0 Тогда
			СтрТЧВИ.МассаОбразца = СтрТЧВИ.ВидИсследования.МассаОбразца;
		КонецЕсли;	   
	КонецЦикла; 
	
	ВИСтрокой = СтрВИ;
	
	Для каждого СтрТЧВИ Из ТЧ_ВидыИсследований Цикл
		//заполняем образцы
		СтрОбр = ТЧ_Образцы.Найти(СтрТЧВИ.ИдентификаторСтрокиТЧОбразцы, "ИдентификаторСтрОбразцы");
		Если НЕ СтрОбр = Неопределено Тогда
			Если ЗначениеЗаполнено(СтрТЧВИ.Образец) Тогда
				ОбразецОб = СтрТЧВИ.Образец.ПолучитьОбъект();
			Иначе	
				ОбразецОб = Справочники.ЛабораторныйОбразец.СоздатьЭлемент();
			КонецЕсли; 
			
			ОбразецОб.ВидИсследования = СтрТЧВИ.ВидИсследования;
			ОбразецОб.ДокументПоступления = Ссылка;
			ОбразецОб.КодПродукта = СтрОбр.КодПродукта;
			ОбразецОб.СерияНоменклатуры = СтрОбр.Серия;
			ОбразецОб.НомерЗамеса = СтрОбр.НомерЗамеса;
			ОбразецОб.Номенклатура = Номенклатура;
			ОбразецОб.Организация = Организация;
			ОбразецОб.МассаОбразца = СтрТЧВИ.МассаОбразца;
			ОбразецОб.ДатаИзготовления = СтрОбр.ДатаИзготовления;
			ОбразецОб.Наименование = Номенклатура;
			
			ОбразецОб.Записать();
			
			СтрТЧВИ.Образец = ОбразецОб.Ссылка;
			
		КонецЕсли; 
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьСвойстваОбъекта(ЭтотОбъект, ДанныеЗаполнения);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	
КонецПроцедуры
